In [2]:
import numpy as np
%timeit np.random.normal(size = 100000)

4.14 ms ± 31.4 µs per loop (mean ± std. dev. of 7 runs, 100 loops each)

In [5]:
walk = 0
draws = np.random.randint(0,2,size = 10)
steps = np.where(draws>0,1,-1)
walk = steps.cumsum()
walk

array([ 1,  0, -1,  0, -1, -2, -3, -4, -3, -2], dtype=int32)

In [8]:
walk.max()

1

In [11]:
walk[np.fabs(walk) > 1]

array([-2, -3, -4, -3, -2], dtype=int32)

In [18]:
(np.fabs(walk) > 1).argmax()

5

In [4]:
import pandas as pd
from pandas import Series,DataFrame
obj = Series([1,2,3],index = ["a","b","d"])
obj

a    1
b    2
d    3
dtype: int64

In [24]:
obj["d"]

3

In [25]:
obj[obj > 2]

d    3
dtype: int64

In [27]:
"b" in obj

True

In [30]:
obj.name = "hahaha"
obj.index.name = "heiheihei"
obj

heiheihei
a    1
b    2
d    3
Name: hahaha, dtype: int64

In [38]:
data = {"state":["Ohio","Ohio","Ohio","Nevada","Nevada"],
       "year":[2000,2001,2002,2001,2002],
       "pop":[1.5,1.7,3.6,2.4,2.9]}
frame = DataFrame(data,columns = ["state","pop","year","debt"])
frame.columns

Index(['state', 'pop', 'year', 'debt'], dtype='object')

In [40]:
frame["debt"]

0    NaN
1    NaN
2    NaN
3    NaN
4    NaN
Name: debt, dtype: object

In [41]:
frame.year

0    2000
1    2001
2    2002
3    2001
4    2002
Name: year, dtype: int64

In [43]:
frame.index = ["one","two","three","four","five"]

In [60]:
frame.loc["one"]

state    Ohio
pop       1.5
year     2000
debt      NaN
Name: one, dtype: object

In [58]:
frame.iloc[0,:2]

state    Ohio
pop       1.5
Name: one, dtype: object

In [61]:
val = Series([1,3,5],index = ["one","three","five"])
frame.debt = val
frame

        state  pop  year  debt
one      Ohio  1.5  2000   1.0
two      Ohio  1.7  2001   NaN
three    Ohio  3.6  2002   3.0
four   Nevada  2.4  2001   NaN
five   Nevada  2.9  2002   5.0

In [64]:
frame["newCol"] = frame.state == "Ohio"
frame

        state  pop  year  debt  newCol
one      Ohio  1.5  2000   1.0    True
two      Ohio  1.7  2001   NaN    True
three    Ohio  3.6  2002   3.0    True
four   Nevada  2.4  2001   NaN   False
five   Nevada  2.9  2002   5.0   False

In [67]:
del frame["newCol"]
frame

        state  pop  year  debt
one      Ohio  1.5  2000   1.0
two      Ohio  1.7  2001   NaN
three    Ohio  3.6  2002   3.0
four   Nevada  2.4  2001   NaN
five   Nevada  2.9  2002   5.0

In [86]:
a = frame.iloc[2,:]
dictionary = [["a","b","c","d"],[1,2,3,4]]
frame.iloc[0:2,:] = dictionary
frame

        state  pop  year debt
one         a    b     c    d
two         1    2     3    4
three       a    b     c    d
four   Nevada  2.4  2001  NaN
five   Nevada  2.9  2002    5

In [74]:
frame.values

array([['Ohio', 1.5, 2000, 1.0],
       ['Ohio', 1.7, 2001, nan],
       ['Ohio', 3.6, 2002, 3.0],
       ['Nevada', 2.4, 2001, nan],
       ['Nevada', 2.9, 2002, 5.0]], dtype=object)

In [95]:
obj = Series([4.5,7.2,-5.3,3.6],index = ["d","b","c","a"])
obj.astype("int64")
obj

d    4.5
b    7.2
c   -5.3
a    3.6
dtype: float64

In [97]:
obj2 = obj.reindex(["a","b","c","d","e"],fill_value = 0)
obj2

a    3.6
b    7.2
c   -5.3
d    4.5
e    0.0
dtype: float64

In [120]:
frame = DataFrame(np.arange(9).reshape(3,3),index = ["a","c","d"],columns = ["Ohio","Texas","California"])
frame.reindex(["a","b","c","d"],method = "ffill")

   Ohio  Texas  California
a     0      1           2
b     0      1           2
c     3      4           5
d     6      7           8

In [128]:
frame1 = frame.drop("c")
frame.drop("California",axis = 1)

   Ohio  Texas
a     0      1
c     3      4
d     6      7

In [155]:
frame.index

Index(['a', 'c', 'd'], dtype='object')

In [162]:
frame.loc["a":"c"]

   Ohio  Texas  California
a     5      5           5
c     5      5           5

In [174]:
frame["California"] = np.where(frame["California"] == 5,1,0)

In [175]:
frame

   Ohio  Texas  California  False
a     5      5           1      5
c     5      5           1      5
d     0      0           0      2

In [182]:
frame.loc[frame.California > 0,:"California"]

   Ohio  Texas  California
a     5      5           1
c     5      5           1

In [191]:
for i in range(4):
    print(i)

0
1
2
3

In [197]:
obj = Series(range(4),index = ["a","c","d","b"])
obj.sort_index(ascending = False)

d    2
c    1
b    3
a    0
dtype: int64

In [200]:
obj.sort_values()

a    0
c    1
d    2
b    3
dtype: int64

In [204]:
obj = Series([4,np.nan,7,np.nan,-3,2])
obj.sort_values()

4   -3.0
5    2.0
0    4.0
2    7.0
1    NaN
3    NaN
dtype: float64

In [210]:
frame = DataFrame({"a":[5,3,7,-1],"b":[4,8,-2,1]})
frame.sort_values(by = "b",ascending = False)

   a  b
1  3  8
0  5  4
3 -1  1
2  7 -2

In [ ]:
frame.loc["a"]

In [219]:
frame.iloc[3] = [np.nan,-1]
frame.sum(axis = 1,skipna = False)

0     9.0
1    11.0
2     5.0
3     NaN
dtype: float64

In [226]:
frame.idxmax()

a    2
b    1
dtype: int64

In [229]:
frame.describe()

         a         b
count  3.0  4.000000
mean   5.0  2.250000
std    2.0  4.645787
min    3.0 -2.000000
25%    4.0 -1.250000
50%    5.0  1.500000
75%    6.0  5.000000
max    7.0  8.000000

In [233]:
import pandas_datareader.data as web
all_data = {}
for ticker in ["AAPL","IBM","MSFT","GOOG"]:
    all_data[ticker] = web.get_data_yahoo(ticker,"1/1/2018","1/3/2018")
    print(all_data[ticker])

                  Open        High         Low       Close   Adj Close  \
Date
2018-01-02  170.160004  172.300003  169.259995  172.259995  171.560516
2018-01-03  172.529999  174.550003  171.960007  172.229996  171.530640

              Volume
Date
2018-01-02  25555900
2018-01-03  29517900

RemoteDataError: Unable to read URL: https://query1.finance.yahoo.com/v7/finance/download/IBM?period1=1514736000&period2=1514995199&interval=1d&events=history&crumb=j3JAJ%5Cu002FClFzD

In [ ]:
import pandas_datareader.data as web
import datetime
ls_key = 'Adj Close'
start = datetime.datetime(2014,1,1)
end = datetime.datetime(2014,3,28)    
f = web.DataReader("F", 'yahoo',start,end)


cleanData = f.loc[ls_key]
dataFrame = pd.DataFrame(cleanData)

dataFrame[:5]

In [ ]:
obj = Series(["a","b","b","a","c","a","b"])
obj.value_counts